###################################################################

# Created by write_sdc on Mon Apr 14 12:23:07 2025

###################################################################
set sdc_version 2.1

set_units -time ns -resistance kOhm -capacitance pF -voltage V -current uA
set_fanout_load 8 [get_ports memwrite]
set_fanout_load 8 [get_ports {adr[7]}]
set_fanout_load 8 [get_ports {adr[6]}]
set_fanout_load 8 [get_ports {adr[5]}]
set_fanout_load 8 [get_ports {adr[4]}]
set_fanout_load 8 [get_ports {adr[3]}]
set_fanout_load 8 [get_ports {adr[2]}]
set_fanout_load 8 [get_ports {adr[1]}]
set_fanout_load 8 [get_ports {adr[0]}]
set_fanout_load 8 [get_ports {writedata[7]}]
set_fanout_load 8 [get_ports {writedata[6]}]
set_fanout_load 8 [get_ports {writedata[5]}]
set_fanout_load 8 [get_ports {writedata[4]}]
set_fanout_load 8 [get_ports {writedata[3]}]
set_fanout_load 8 [get_ports {writedata[2]}]
set_fanout_load 8 [get_ports {writedata[1]}]
set_fanout_load 8 [get_ports {writedata[0]}]
set_load -pin_load 0.1 [get_ports memwrite]
set_load -pin_load 0.1 [get_ports {adr[7]}]
set_load -pin_load 0.1 [get_ports {adr[6]}]
set_load -pin_load 0.1 [get_ports {adr[5]}]
set_load -pin_load 0.1 [get_ports {adr[4]}]
set_load -pin_load 0.1 [get_ports {adr[3]}]
set_load -pin_load 0.1 [get_ports {adr[2]}]
set_load -pin_load 0.1 [get_ports {adr[1]}]
set_load -pin_load 0.1 [get_ports {adr[0]}]
set_load -pin_load 0.1 [get_ports {writedata[7]}]
set_load -pin_load 0.1 [get_ports {writedata[6]}]
set_load -pin_load 0.1 [get_ports {writedata[5]}]
set_load -pin_load 0.1 [get_ports {writedata[4]}]
set_load -pin_load 0.1 [get_ports {writedata[3]}]
set_load -pin_load 0.1 [get_ports {writedata[2]}]
set_load -pin_load 0.1 [get_ports {writedata[1]}]
set_load -pin_load 0.1 [get_ports {writedata[0]}]
set_max_fanout 1 [get_ports clk]
set_max_fanout 1 [get_ports reset]
create_clock -name sys_clk  -period 40  -waveform {0 20}
create_clock -name clk  -period 40  -waveform {0 20}
set_clock_latency 0.3  [get_clocks clk]
set_input_delay -clock clk  2  [get_ports clk]
set_input_delay -clock clk  2  [get_ports reset]
set_output_delay -clock clk  1.65  [get_ports memwrite]
set_output_delay -clock clk  1.65  [get_ports {adr[7]}]
set_output_delay -clock clk  1.65  [get_ports {adr[6]}]
set_output_delay -clock clk  1.65  [get_ports {adr[5]}]
set_output_delay -clock clk  1.65  [get_ports {adr[4]}]
set_output_delay -clock clk  1.65  [get_ports {adr[3]}]
set_output_delay -clock clk  1.65  [get_ports {adr[2]}]
set_output_delay -clock clk  1.65  [get_ports {adr[1]}]
set_output_delay -clock clk  1.65  [get_ports {adr[0]}]
set_output_delay -clock clk  1.65  [get_ports {writedata[7]}]
set_output_delay -clock clk  1.65  [get_ports {writedata[6]}]
set_output_delay -clock clk  1.65  [get_ports {writedata[5]}]
set_output_delay -clock clk  1.65  [get_ports {writedata[4]}]
set_output_delay -clock clk  1.65  [get_ports {writedata[3]}]
set_output_delay -clock clk  1.65  [get_ports {writedata[2]}]
set_output_delay -clock clk  1.65  [get_ports {writedata[1]}]
set_output_delay -clock clk  1.65  [get_ports {writedata[0]}]
